Repository: ZihCiLai/FlutterWeb
Catalog: assets/lib/l10n/app_*.arb
Languages: vi, zh, zh_tw

# welcomeMessage
source: Welcome {appName}
vi: 歡迎使用 {appName}
zh: 欢迎使用 {appName}
zh_tw: 歡迎使用 {appName}

# quantity
source: Qty：{number}
vi: Số lượng：{number}
zh: 数量：{number}
zh_tw: 數量：{number}

# satisfaction
source: Score{number}
vi: điểm{number}
zh: 满意度{number}
zh_tw: 滿意度{number}

source: Product Reviews
vi: Đánh giá sản phẩm
zh: 商品评价
zh_tw: 商品評價

source: Write a review
vi: Viết bài đánh giá
zh: 撰写意见
zh_tw: 撰寫意見

source: Please enter your comment
vi: Vui lòng nhập bình luận của bạn
zh: 请输入你的意见
zh_tw: 請輸入你的意見

source: Unboxing Photos
vi: mở hộp ảnh
zh: 开箱照
zh_tw: 開箱照

source: Confirm Sent
vi: Xác nhận đã gửi
zh: 确认发送
zh_tw: 確認發送

source: Select Image Source
vi: Chọn nguồn ảnh
zh: 选择图片来源
zh_tw: 選擇圖片來源

# selectImageSourceDescription
source: Please choose to pick an image from the gallery or take a photo with the camera.
vi: Vui lòng chọn để chọn ảnh từ thư viện hoặc chụp ảnh bằng máy ảnh.
zh: 请选择要从相册中获取图片，还是使用相机拍照。
zh_tw: 請選擇要從相簿中取得圖片，還是使用相機拍照。

source: Gallery
vi: Thư viện
zh: 相册
zh_tw: 相簿

source: Camera
vi: Máy ảnh
zh: 相机
zh_tw: 拍照

# deleted
source: Deleted successfully
vi: Đã xóa thành công
zh: 删除成功
zh_tw: 刪除成功

# evaluationCompleted
source: Completed
vi: Hoàn thành
zh: 评价完成
zh_tw: 評價完成

source: To Delete
vi: Để xóa
zh: 进行删除
zh_tw: 進行刪除

# toDeleteAsk
source: Are you sure you want to delete this address?
vi: Bạn có chắc chắn muốn xóa địa chỉ này không?
zh: 您确定要删除此地址吗？
zh_tw: 您確定要刪除此地址嗎？

# deliveyAddress
source: Delivery Address
vi: Địa chỉ giao hàng
zh: 收货地址
zh_tw: 收件地址

source: Add
vi: Thêm vào
zh: 添加
zh_tw: 添加

source: Delete
vi: xóa bỏ
zh: 删除
zh_tw: 刪除

# editA
source: Edit
vi: biên tập
zh: 编辑
zh_tw: 編輯

source: Coupon
vi: Phiếu giảm giá
zh: 优惠券
zh_tw: 優惠券

source: Enter Coupon Code
vi: Nhập mã giảm giá
zh: 输入优惠码
zh_tw: 輸入優惠碼

source: Please enter coupon code
vi: Vui lòng nhập mã giảm giá
zh: 请输入优惠码
zh_tw: 請輸入優惠碼

source: Confirm
vi: Xác nhận
zh: 确认
zh_tw: 確認

source: Cancel
vi: Hủy bỏ
zh: 取消
zh_tw: 取消

source: Usage Rules
vi: Quy tắc sử dụng
zh: 使用规则
zh_tw: 使用規則

# availableTime
source: Available Time: {start}~{end}
vi: Thời gian sử dụng: {start}~{end}
zh: 使用时间：{start}~{end}
zh_tw: 使用時間：{start}~{end}

# couponFullRule
source: Full reduction coupon usage rules
vi: Quy tắc sử dụng phiếu giảm giá
zh: 满减券使用规则
zh_tw: 滿減券使用規則

# couponFullContent
source: Full reduction coupon: Can only be used when the order meets the required amount (excluding taxes and shipping fees). Example: A 50-off coupon for orders over 200 can be used to deduct 50 from a 200 order, but cannot be used if the total order amount falls below 200 after applying the coupon.
vi: Phiếu giảm giá: Chỉ có thể sử dụng khi giá trị đơn hàng đáp ứng yêu cầu (không bao gồm thuế và phí vận chuyển). Ví dụ: Một phiếu giảm 50 cho đơn hàng từ 200, có thể sử dụng phiếu để giảm 50 từ đơn hàng 200, nhưng không thể sử dụng nếu tổng giá trị đơn hàng dưới 200 sau khi áp dụng phiếu.
zh: 满减券：必须达到订单满足要求的商品金额（不含税费和运费）时才能使用。 例：一张满200减50的券，购买200元的商品就可以使用该券减少50元，但是购买后订单总金额不满200元是不可以使用该券。
zh_tw: 滿減券：必須達到訂單滿足要求的商品金額（不含稅費和運費）時才能使用。 例：一張滿200減50的券，購買200元的商品就可以使用該券減少50元，但是購買後訂單總金額不滿200元是不可以使用該券。

# couponCashRule
source: Cash coupon usage rules
vi: Quy tắc sử dụng phiếu tiền mặt
zh: 现金券使用规则
zh_tw: 現金券使用規則

# couponCashContent
source: Cash coupon: Can be used to reduce the total order amount. If the value of the coupon is less than the total order amount, it cannot be used. Example: A cash coupon worth 25 can be used if the order exceeds 25, but cannot be used if the order is 25 or less.
vi: Phiếu tiền mặt: Có thể được sử dụng để giảm tổng giá trị đơn hàng. Nếu mệnh giá của phiếu thấp hơn tổng giá trị đơn hàng, không thể sử dụng. Ví dụ: Phiếu tiền mặt trị giá 25 có thể sử dụng nếu đơn hàng trên 25, nhưng không thể sử dụng nếu đơn hàng bằng hoặc nhỏ hơn 25.
zh: 现金券：可用于减免订单总金额，但现金券面额低于订单总金额，则无法使用。 例：现金券面额25元，订单金额超过25元即可减免，低于或等于25元则无法减免。
zh_tw: 現金券：可用於減免訂單總金額，但現金券面額低於訂單總金額，則無法使用。 例：現金券面額25元，訂單金額超過25元即可減免，低於或等於25元則無法減免。

# couponPostageRule
source: Postage coupon usage rules
vi: Quy tắc sử dụng phiếu miễn phí vận chuyển
zh: 抵邮券使用规则
zh_tw: 抵郵券使用規則

# couponPostageContent
source: Postage coupon: Can be used to offset shipping fees. If the shipping fee is less than the value of the coupon, it cannot be used. Example: A postage coupon worth 80 can offset shipping fees exceeding 80, but cannot offset shipping fees of 80 or less.
vi: Phiếu miễn phí vận chuyển: Có thể dùng để giảm phí vận chuyển. Nếu phí vận chuyển thấp hơn giá trị phiếu, không thể sử dụng. Ví dụ: Phiếu vận chuyển trị giá 80, nếu phí vận chuyển vượt quá 80 sẽ được giảm, nếu thấp hơn hoặc bằng 80 sẽ không thể sử dụng.
zh: 抵邮券：可用于减免运费(邮费)，但运费低于抵邮券，则无法使用。 例：抵邮费面额80元，运费超过80元即可折抵运费，低于或等于80元则无法折抵运费。
zh_tw: 抵郵券：可用於減免運費(郵費)，但運費低於抵郵券，則無法使用。 例：抵郵費面額80元，運費超過80元即可折抵運費，低於或等於80元則無法折抵運費。

# couponGiftRule
source: Gift coupon usage rules
vi: Quy tắc sử dụng phiếu giảm giá quà tặng
zh: 伴手礼折抵券使用规则
zh_tw: 伴手禮折抵券使用規則

# couponGiftContent
source: Gift coupon: Can be used to reduce the total order amount, but cannot be used for non-gift products. If the value of the coupon is less than the total order amount, it cannot be used.
vi: Phiếu giảm giá quà tặng: Chỉ sử dụng được cho các sản phẩm quà tặng. Nếu mệnh giá của phiếu thấp hơn tổng giá trị đơn hàng, không thể sử dụng.
zh: 伴手礼折抵券：可用于减免订单总金额，但非伴手礼之商品则无法使用。若伴手礼折抵券之面额低于订单总金额，则无法使用。
zh_tw: 伴手禮折抵券：可用於減免訂單總金額,但非伴手禮之商品則無法使用。若伴手禮折抵券之面額低於訂單總金額，則無法使用。

# couponBeautyRule
source: Beauty coupon usage rules
vi: Quy tắc sử dụng phiếu giảm giá mỹ phẩm
zh: 美妆折抵券使用规则
zh_tw: 美妝折抵券使用規則

# couponBeautyContent
source: Beauty coupon: Can be used to reduce the total order amount, but cannot be used for non-beauty products (or certain beauty products). If the value of the coupon is less than the total order amount, it cannot be used.
vi: Phiếu giảm giá mỹ phẩm: Chỉ sử dụng được cho các sản phẩm mỹ phẩm. Nếu mệnh giá của phiếu thấp hơn tổng giá trị đơn hàng, không thể sử dụng.
zh: 美妆折抵券：可用于减免订单总金额，但非美妆之商品（或部分美妆商品）无法使用。若美妆折抵券之面额低于订单总金额，则无法使用。
zh_tw: 美妝折抵券：可用於減免訂單總金額,但非美妝之商品(或部份美妝商品)無法使用。若美妝折抵券之面額低於訂單總金額，則無法使用。

source: My Favorite
vi: yêu thích
zh: 我的最爱
zh_tw: 我的最爱

# loadingMessage
source: Loading..
vi: Đang xử lý..
zh: 处理中请稍候..
zh_tw: 處理中請稍候..

source: Favorite Items
vi: Mục yêu thích
zh: 收藏商品
zh_tw: 收藏商品

# favoriteShops
source: Follow shops
vi: Theo dõi cửa hàng
zh: 关注店铺
zh_tw: 關注店舖

source: Collection:{date}
vi: Ngày thu thập:{date}
zh: 收藏日期:{date}
zh_tw: 收藏日期:{date}

source: Privacy Policy
vi: Chính sách quyền riêng tư
zh: 隐私权政策
zh_tw: 隱私權政策

# privacyPolicyLocal
source: Displayed by the local machine
vi: Được hiển thị bởi máy cục bộ
zh: 由本机端显示
zh_tw: 由本機端顯示

# privacyPolicyNetwork
source: Display from the network
vi: Hiển thị từ phía mạng
zh: 从网路端显示
zh_tw: 從網路端顯示

# copyRight
source: © 2024 JoyBon All rights reserved.
zh: © 2024 自游邦 版权所有
zh_tw: © 2024 自游邦 版權所有

source: About JoyBon
vi: Về tự do băng
zh: 关于自游邦
zh_tw: 關於自游邦

# joyBonDescriptions
source: JOYBON is a mobile application platform that provides users with local services for overseas travel. Through mobile networking technology, it helps users to play better, recommends the most local and most unique shopping stores in travel destinations, and shares the most complete and comprehensive travel destinations. Preferential shopping information allows users to enjoy the most convenient services for overseas travel shopping, product discounts, logistics and delivery. Let travel lovers and shopping lovers no longer worry about shopping itineraries, product prices, logistics and transportation, and provide travel users with peace of mind, time-saving, and labor-saving travel assistance to make travel more free.
vi: Tự do băng, là nền tảng ứng dụng di động cung cấp dịch vụ địa phương cho người dùng trong du lịch nước ngoài. Thông qua công nghệ mạng di động, giúp người dùng chơi tốt hơn, giới thiệu các cửa hàng mua sắm địa phương và đặc sắc nhất tại điểm đến du lịch, chia sẻ thông tin mua sắm đầy đủ và ưu đãi nhất tại điểm đến du lịch, để người dùng tận hưởng dịch vụ mua sắm du lịch nước ngoài, giảm giá sản phẩm, giao hàng thuận tiện nhất. Giúp người yêu du lịch, yêu mua sắm không còn lo lắng về lịch trình mua sắm, giá cả sản phẩm, vận chuyển hàng hóa, cung cấp sự hỗ trợ du lịch tiết kiệm thời gian, công sức cho người dùng trong chuyến đi, làm cho chuyến đi tự do hơn.
zh: 自游邦，是为用户提供境外旅游的在地服务的移动应用平台。通过移动联网技术，帮助用户更好游玩，推荐旅游目的地最本土、最特色的购物商店，分享旅游目的地最全最优惠的购物信息，让用户享受最便捷的境外旅游购物、商品折扣、物流配送等服务。 让爱旅游、爱购物的用户不再为购物行程、商品价格、物流运输烦恼，为旅行中的用户提供省心、省时、 省力的旅行帮助，让自由行更自由。
zh_tw: 自游邦，是為用戶提供境外旅遊的在地服務的移動應用平台。通過移動聯網技術，幫助用戶更好遊玩，推薦旅遊目的地最本土、最特色的購物商店，分享旅遊目的地最完全最優惠的購物信息，讓用戶享受最便捷的境外旅遊購物、商品折扣、物流配送等服務。 讓愛旅遊、愛購物的用戶不再為購物行程、商品價格、物流運輸煩惱，為旅行中的用戶提供省心、省時省力的旅行幫助，讓自由行更自由。
